Config/DataProcessors/ЗаполнениеРегистровОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеРегистровОС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/AccumulationRegisters/АмортизацияОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>АмортизацияОбъектовОС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccumulationRegisters/СтоимостьОбъектовОСПоКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьОбъектовОСПоКонтрагентам</Name>
			<Comment>Стоимость и количество объектов на счетах 01, 02, 24, 25, 26, 27</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРаспоряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаспоряженияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/DataProcessors/ЗаполнениеРегистровОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Данные(Организация, Период, Флаги) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация"			, Организация);
	Запрос.Параметры.Вставить("Период"				, Период + 1);
	Запрос.Параметры.Вставить("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Запрос.Параметры.Вставить("ПустоеПодразделение"	, Справочники.Подразделения.ПустаяСсылка());
	Запрос.Параметры.Вставить("ПустойНомер"			, Справочники.ИнвентарныеНомераОС.ПустаяСсылка());
	Запрос.Параметры.Вставить("ПустаяДата"			, '00010101');
	
	Запрос.Параметры.Вставить("СчетУчета"			, БухгалтерскийУчет.СписокСчетов("101.00,102.00,103.00,108.00,111.60,21"));
	Запрос.Параметры.Вставить("СчетАмортизации"		, БухгалтерскийУчет.СписокСчетов("104.10,104.20,104.30,104.50,104.60,104.90"));
	Запрос.Параметры.Вставить("СчетОбесценения"		, БухгалтерскийУчет.СписокСчетов("114.10,114.20,114.30,114.60,114.70"));
	
	Запрос.Параметры.Вставить("Счет01"				, БухгалтерскийУчет.СписокСчетов("01"));
	Запрос.Параметры.Вставить("Счет02"				, БухгалтерскийУчет.СписокСчетов("02"));
	Запрос.Параметры.Вставить("Счет21"				, БухгалтерскийУчет.СписокСчетов("21"));
	Запрос.Параметры.Вставить("Счет25"				, БухгалтерскийУчет.СписокСчетов("25"));
	Запрос.Параметры.Вставить("Счет26"				, БухгалтерскийУчет.СписокСчетов("26"));
	Запрос.Параметры.Вставить("Счет2701"            , БухгалтерскийУчет.СписокСчетов("27.01"));
	
	Запрос.Параметры.Вставить("Субконто1"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства"));
	Запрос.Параметры.Вставить("Субконто21"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,ЦМО"));
	Запрос.Параметры.Вставить("Субконто22"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,Контрагенты"));
	Запрос.Параметры.Вставить("Субконто23"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,Договоры"));
	Запрос.Параметры.Вставить("Субконто31"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,ЦМО,Контрагенты"));
	Запрос.Параметры.Вставить("Субконто32"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,ЦМО,Договоры"));
	
	Запрос.УстановитьПараметр("СчетаБаланс"			, БухгалтерскийУчет.СписокСчетов("101.00,102.00,103.00,108.00,111.60"));
	Запрос.УстановитьПараметр("СчетаКапВложение"	, БухгалтерскийУчет.СписокСчетов("106.00"));
	Запрос.УстановитьПараметр("СчетаВПути"			, БухгалтерскийУчет.СписокСчетов("107.00"));
	Запрос.УстановитьПараметр("ПустойКПС"			, Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка());
	
	Результат = Новый Структура;
	
	Для Каждого ПроверкаРегистра Из Флаги Цикл
		Если ПроверкаРегистра.Значение Тогда
			
			ИмяРегистра = ПроверкаРегистра.Ключ;
			
			Если ИмяРегистра = "АмортизацияОбъектовОС" Тогда
				ДанныеРегистра = ДанныеАмортизацияОбъектовОС(Запрос);
			ИначеЕсли ИмяРегистра = "СтоимостьОбъектовОС" Тогда
				ДанныеРегистра = ДанныеСтоимостьОбъектовОС(Запрос);
			ИначеЕсли ИмяРегистра = "СтоимостьОбъектовОСПоКонтрагентам" Тогда
				ДанныеРегистра = ДанныеСтоимостьОбъектовОСПоКонтрагентам(Запрос);
			ИначеЕсли ИмяРегистра = "УчетныеДанныеОбъектаОС" Тогда
				ДанныеРегистра = ДанныеУчетныеДанныеОбъектаОС(Запрос);
			Иначе
				ДанныеРегистра = Новый ТаблицаЗначений;
			КонецЕсли;
			
			Результат.Вставить(ИмяРегистра, ДанныеРегистра);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеАмортизацияОбъектовОС(Запрос)
	
	Запрос.Текст = ТекстЗапросаАмортизация();
	ДанныеАмортизация = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеАмортизация.Количество() = 0 Тогда
		Возврат ДанныеАмортизация;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаИнвНомераБаланс();
	ИнвНомера = Запрос.Выполнить().Выгрузить();
	ИнвНомера.Индексы.Добавить("ОсновноеСредство");
	
	// Преобразуем данные, раскидываем амортизацию по инвентарным номерам
	
	Данные = ДанныеАмортизация.СкопироватьКолонки();
	Данные.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	Для Каждого СтрокаДанных Из ДанныеАмортизация Цикл
		
		Отбор = Новый Структура("ОсновноеСредство", СтрокаДанных.ОсновноеСредство);
		ИнвНомераСтроки = ИнвНомера.НайтиСтроки(Отбор);
		
		КолВоНомеров = ИнвНомераСтроки.Количество();
		
		Если КолВоНомеров = 0 Тогда
			НоваяСтрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		ИначеЕсли КолВоНомеров = 1 Тогда
			НоваяСтрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			НоваяСтрока.ИнвентарныйНомер = ИнвНомераСтроки[0].ИнвентарныйНомер;
		Иначе
			
			АмортизацияЕд = Окр(СтрокаДанных.СуммаАмортизации / КолВоНомеров, 2);
			ОбесценениеЕд = Окр(СтрокаДанных.СуммаОбесценения / КолВоНомеров, 2);
			
			Для Сч = 1 По КолВоНомеров Цикл
				НоваяСтрока = Данные.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				НоваяСтрока.ИнвентарныйНомер = ИнвНомераСтроки[Сч-1].ИнвентарныйНомер;
				НоваяСтрока.СуммаАмортизации = АмортизацияЕд;
				НоваяСтрока.СуммаОбесценения = ОбесценениеЕд;
				
				Если Сч = КолВоНомеров Тогда
					НоваяСтрока.СуммаАмортизации = НоваяСтрока.СуммаАмортизации + (СтрокаДанных.СуммаАмортизации - АмортизацияЕд*КолВоНомеров);
					НоваяСтрока.СуммаОбесценения = НоваяСтрока.СуммаОбесценения + (СтрокаДанных.СуммаОбесценения - ОбесценениеЕд*КолВоНомеров);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ТекстЗапросаАмортизация()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	-ЕПСБУОстатки.СуммаОстаток КАК СуммаАмортизации,
	|	0 КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_Амортизация
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетАмортизации), &Субконто1, Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	0,
	|	-ЕПСБУОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетОбесценения), &Субконто1, Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.Организация,
	|	АмортизацияОбъектовОСОстатки.ОсновноеСредство,
	|	-АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток,
	|	-АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(&Период, Организация = &Организация) КАК АмортизацияОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Амортизация.Организация КАК Организация,
	|	ВТ_Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВТ_Амортизация.СуммаАмортизации) КАК СуммаАмортизации,
	|	СУММА(ВТ_Амортизация.СуммаОбесценения) КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_АмортизацияРазница
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Амортизация.Организация,
	|	ВТ_Амортизация.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ.Организация КАК Организация,
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ.СуммаАмортизации КАК СуммаАмортизации,
	|	0 КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_АмортизацияДвижения
	|ИЗ
	|	ВТ_АмортизацияРазница КАК ВТ
	|ГДЕ
	|	ВТ.СуммаАмортизации > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВТ.Организация,
	|	ВТ.ОсновноеСредство,
	|	-ВТ.СуммаАмортизации,
	|	0
	|ИЗ
	|	ВТ_АмортизацияРазница КАК ВТ
	|ГДЕ
	|	ВТ.СуммаАмортизации < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ.Организация,
	|	ВТ.ОсновноеСредство,
	|	0,
	|	ВТ.СуммаОбесценения
	|ИЗ
	|	ВТ_АмортизацияРазница КАК ВТ
	|ГДЕ
	|	ВТ.СуммаОбесценения > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВТ.Организация,
	|	ВТ.ОсновноеСредство,
	|	0,
	|	-ВТ.СуммаОбесценения
	|ИЗ
	|	ВТ_АмортизацияРазница КАК ВТ
	|ГДЕ
	|	ВТ.СуммаОбесценения < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ВидДвижения КАК ВидДвижения,
	|	ВТ.Организация КАК Организация,
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВТ.СуммаАмортизации) КАК СуммаАмортизации,
	|	СУММА(ВТ.СуммаОбесценения) КАК СуммаОбесценения
	|ИЗ
	|	ВТ_АмортизацияДвижения КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ВидДвижения,
	|	ВТ.Организация,
	|	ВТ.ОсновноеСредство";
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ДанныеСтоимостьОбъектовОС(Запрос)
	
	Запрос.Текст = ТекстЗапросаСтоимость();
	ДанныеСтоимость = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеСтоимость.Количество() = 0 Тогда
		Возврат ДанныеСтоимость;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаИнвНомераБаланс();
	ИнвНомера = Запрос.Выполнить().Выгрузить();
	ИнвНомера.Индексы.Добавить("ОсновноеСредство");
	
	Запрос.Текст = ТекстЗапросаИнвНомераОперУчет();
	ИнвНомераОперУчет = Запрос.Выполнить().Выгрузить();
	ИнвНомераОперУчет.Индексы.Добавить("ОсновноеСредство");
	
	// Преобразуем данные, раскидываем стоимость и количество по инвентарным номерам
	
	Данные = ДанныеСтоимость.СкопироватьКолонки();
	Данные.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	Для Каждого СтрокаДанных Из ДанныеСтоимость Цикл
		
		Отбор = Новый Структура("ОсновноеСредство", СтрокаДанных.ОсновноеСредство);
		Если СтрокаДанных.ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ОперативныйУчет Тогда
			ИнвНомераСтроки = ИнвНомераОперУчет.НайтиСтроки(Отбор);
		Иначе
			ИнвНомераСтроки = ИнвНомера.НайтиСтроки(Отбор);
		КонецЕсли;
		
		КолВоНомеров = ИнвНомераСтроки.Количество();
		
		Если КолВоНомеров = 0 Тогда
			НоваяСтрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		ИначеЕсли КолВоНомеров = 1 Тогда
			НоваяСтрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			НоваяСтрока.ИнвентарныйНомер = ИнвНомераСтроки[0].ИнвентарныйНомер;
		Иначе
			
			СтоимостьЕд = Окр(СтрокаДанных.Стоимость / КолВоНомеров, 2);
			КоличествоЕд = Цел(СтрокаДанных.Количество / КолВоНомеров);
			
			Для Сч = 1 По КолВоНомеров Цикл 
				НоваяСтрока = Данные.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				НоваяСтрока.ИнвентарныйНомер = ИнвНомераСтроки[Сч-1].ИнвентарныйНомер;
				НоваяСтрока.Количество = КоличествоЕд;
				НоваяСтрока.Стоимость = СтоимостьЕд;
				
				Если Сч = КолВоНомеров Тогда
					НоваяСтрока.Количество = НоваяСтрока.Количество + (СтрокаДанных.Количество - КоличествоЕд*КолВоНомеров);
					НоваяСтрока.Стоимость = НоваяСтрока.Стоимость + (СтрокаДанных.Стоимость - СтоимостьЕд*КолВоНомеров);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ТекстЗапросаИнвНомераБаланс()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОССрезПоследних.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				ТОГДА СобытияОССрезПоследних.ДатаСобытия
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОССрезПоследних.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|				ТОГДА СобытияОССрезПоследних.ДатаСобытия
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ) КАК ДатаСписания
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(&Период, Организация = &Организация) КАК СобытияОССрезПоследних
	|ГДЕ
	|	СобытияОССрезПоследних.ДатаСобытия <> &ПустаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОССрезПоследних.ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнвНомера.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ИнвНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|ГДЕ
	|	ВТ_ИнвНомера.ОсновноеСредство.ГрупповойУчет
	|	И ВТ_ИнвНомера.ДатаПринятияКУчету <> &ПустаяДата
	|	И ВТ_ИнвНомера.ДатаСписания = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИнвНомера.ОсновноеСредство,
	|	МАКСИМУМ(ВТ_ИнвНомера.ИнвентарныйНомер)
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|ГДЕ
	|	НЕ ВТ_ИнвНомера.ОсновноеСредство.ГрупповойУчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИнвНомера.ОсновноеСредство";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИнвНомераОперУчет()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)) КАК СобытияОССрезПоследних
	|ГДЕ
	|	СобытияОССрезПоследних.ДатаСобытия <> &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнвНомера.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ИнвНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|ГДЕ
	|	ВТ_ИнвНомера.ОсновноеСредство.ГрупповойУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИнвНомера.ОсновноеСредство,
	|	МАКСИМУМ(ВТ_ИнвНомера.ИнвентарныйНомер)
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|ГДЕ
	|	НЕ ВТ_ИнвНомера.ОсновноеСредство.ГрупповойУчет
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИнвНомера.ОсновноеСредство";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСтоимость()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВидСубконтоЦМО.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьЦМО,
	|	ВЫБОР
	|		КОГДА ВидСубконтоДоговор.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьДоговор
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоЦМО
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоЦМО.Ссылка
	|			И (ВидСубконтоЦМО.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоДоговор
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоДоговор.Ссылка
	|			И (ВидСубконтоДоговор.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&СчетУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЕПСБУОстатки.Субконто2 КАК ЦМО,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Счет В (&Счет21)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	ЕПСБУОстатки.СуммаОстаток КАК Стоимость,
	|	ЕПСБУОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьЦМО
	|					И НЕ ВТ.ЕстьДоговор),
	|			&Субконто21,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Счет В (&Счет21)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ,
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета КАК ВТ
	|				ГДЕ
	|					НЕ ВТ.ЕстьЦМО
	|					И НЕ ВТ.ЕстьДоговор),
	|			&Субконто1,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЕПСБУОстатки.Субконто2,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Счет В (&Счет21)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ,
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьДоговор
	|					И НЕ ВТ.ЕстьЦМО),
	|			&Субконто23,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЕПСБУОстатки.Субконто2,
	|	ЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Счет В (&Счет21)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ,
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьДоговор
	|					И ВТ.ЕстьЦМО),
	|			&Субконто32,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.Организация,
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ЦМО,
	|	СтоимостьОбъектовОСОстатки.Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА СтоимостьОбъектовОСОстатки.Подразделение
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	СтоимостьОбъектовОСОстатки.ВидРаспоряжения,
	|	-СтоимостьОбъектовОСОстатки.СтоимостьОстаток,
	|	-СтоимостьОбъектовОСОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&Период, Организация = &Организация) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Стоимость.Организация КАК Организация,
	|	ВТ_Стоимость.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Стоимость.ЦМО КАК ЦМО,
	|	ВТ_Стоимость.Договор КАК Договор,
	|	ВТ_Стоимость.Подразделение КАК Подразделение,
	|	ВТ_Стоимость.ВидРаспоряжения КАК ВидРаспоряжения,
	|	СУММА(ВТ_Стоимость.Стоимость) КАК Стоимость,
	|	СУММА(ВТ_Стоимость.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_СтоимостьРазница
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Стоимость.Организация,
	|	ВТ_Стоимость.ОсновноеСредство,
	|	ВТ_Стоимость.ЦМО,
	|	ВТ_Стоимость.Договор,
	|	ВТ_Стоимость.Подразделение,
	|	ВТ_Стоимость.ВидРаспоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВТ.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ВТ.Организация КАК Организация,
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ.ЦМО КАК ЦМО,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА -ВТ.Стоимость
	|		ИНАЧЕ ВТ.Стоимость
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА -ВТ.Количество
	|		ИНАЧЕ ВТ.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_СтоимостьРазница КАК ВТ
	|ГДЕ
	|	(ВТ.Стоимость <> 0
	|			ИЛИ ВТ.Количество <> 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ДанныеСтоимостьОбъектовОСПоКонтрагентам(Запрос)
	
	Запрос.Текст = ТекстЗапросаПоКонтрагентам();
	Данные = Запрос.Выполнить().Выгрузить();
	
	Возврат Данные;
	
КонецФункции

Функция ТекстЗапросаПоКонтрагентам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВидСубконтоКонтрагент.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКонтрагент,
	|	ВЫБОР
	|		КОГДА ВидСубконтоДоговор.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьДоговор
	|ПОМЕСТИТЬ ВТ_Счета01
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоКонтрагент
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоКонтрагент.Ссылка
	|			И (ВидСубконтоКонтрагент.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоДоговор
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоДоговор.Ссылка
	|			И (ВидСубконтоДоговор.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет01)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВидСубконтоКонтрагент.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКонтрагент,
	|	ВЫБОР
	|		КОГДА ВидСубконтоДоговор.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьДоговор
	|ПОМЕСТИТЬ ВТ_Счета02
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоКонтрагент
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоКонтрагент.Ссылка
	|			И (ВидСубконтоКонтрагент.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоДоговор
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоДоговор.Ссылка
	|			И (ВидСубконтоДоговор.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидСубконтоОС
	|		ПО ЕПСБУ.Ссылка = ВидСубконтоОС.Ссылка
	|			И (ВидСубконтоОС.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет02)
	|	И НЕ ВидСубконтоОС.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентарныеНомераОС.ОС КАК ОсновноеСредство,
	|	МАКСИМУМ(ИнвентарныеНомераОС.Ссылка) КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Владелец = &Организация
	|	И НЕ ИнвентарныеНомераОС.ОС.ГрупповойУчет
	|	И НЕ ИнвентарныеНомераОС.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентарныеНомераОС.ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЕПСБУОстатки.Субконто2 КАК ЦМО,
	|	ЕПСБУОстатки.Субконто3 КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование) КАК ВидРаспоряжения,
	|	ЕПСБУОстатки.СуммаОстаток КАК Стоимость,
	|	ЕПСБУОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета01 КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьКонтрагент),
	|			&Субконто31,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЕПСБУОстатки.Субконто2,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто3 КАК Справочник.Договоры).Контрагент,
	|	ЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета01 КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьДоговор),
	|			&Субконто32,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЕПСБУОстатки.Субконто2,
	|	ЕПСБУОстатки.Субконто3,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета02 КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьКонтрагент),
	|			&Субконто31,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЕПСБУОстатки.Субконто2,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто3 КАК Справочник.Договоры).Контрагент,
	|	ЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета02 КАК ВТ
	|				ГДЕ
	|					ВТ.ЕстьДоговор),
	|			&Субконто32,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЕПСБУОстатки.Субконто2,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Счета02 КАК ВТ
	|				ГДЕ
	|					НЕ ВТ.ЕстьКонтрагент
	|					И НЕ ВТ.ЕстьДоговор),
	|			&Субконто21,
	|			Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЕПСБУОстатки.Субконто2,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет25), &Субконто22, Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЕПСБУОстатки.Субконто2,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет26), &Субконто22, Организация = &Организация) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.Организация,
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|				ИЛИ СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|		ИНАЧЕ СтоимостьОбъектовОСОстатки.ЦМО
	|	КОНЕЦ,
	|	СтоимостьОбъектовОСОстатки.Контрагент,
	|	СтоимостьОбъектовОСОстатки.Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА СтоимостьОбъектовОСОстатки.Подразделение
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	СтоимостьОбъектовОСОстатки.ВидРаспоряжения,
	|	-СтоимостьОбъектовОСОстатки.СтоимостьОстаток,
	|	-СтоимостьОбъектовОСОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(&Период, Организация = &Организация) КАК СтоимостьОбъектовОСОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ЕПСБУОстатки.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЕПСБУОстатки.Субконто2,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(ЕПСБУОстатки.Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ &ПустоеПодразделение
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование),
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕПСБУОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет2701), &Субконто22, Организация = &Организация) КАК ЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Стоимость.Организация КАК Организация,
	|	ВТ_Стоимость.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Стоимость.ЦМО КАК ЦМО,
	|	ВТ_Стоимость.Контрагент КАК Контрагент,
	|	ВТ_Стоимость.Договор КАК Договор,
	|	ВТ_Стоимость.Подразделение КАК Подразделение,
	|	ВТ_Стоимость.ВидРаспоряжения КАК ВидРаспоряжения,
	|	СУММА(ВТ_Стоимость.Стоимость) КАК Стоимость,
	|	СУММА(ВТ_Стоимость.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_СтоимостьРазница
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Стоимость.Организация,
	|	ВТ_Стоимость.ОсновноеСредство,
	|	ВТ_Стоимость.ЦМО,
	|	ВТ_Стоимость.Подразделение,
	|	ВТ_Стоимость.ВидРаспоряжения,
	|	ВТ_Стоимость.Контрагент,
	|	ВТ_Стоимость.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВТ.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ВТ.Организация КАК Организация,
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ВТ_СобытияОС.ИнвентарныйНомер, &ПустойНомер) КАК ИнвентарныйНомер,
	|	ВТ.ЦМО КАК ЦМО,
	|	ВТ.Контрагент КАК Контрагент,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА -ВТ.Стоимость
	|		ИНАЧЕ ВТ.Стоимость
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВТ.Стоимость < 0
	|			ТОГДА -ВТ.Количество
	|		ИНАЧЕ ВТ.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_СтоимостьРазница КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ВТ.ОсновноеСредство = ВТ_СобытияОС.ОсновноеСредство
	|ГДЕ
	|	(ВТ.Стоимость <> 0
	|			ИЛИ ВТ.Количество <> 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДанныеУчетныеДанныеОбъектаОС(Запрос)
	
	Запрос.Текст = ТекстЗапросаУчетныеДанные();
	Данные = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из Данные Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВидИмущества) Тогда
			СтрокаТаблицы.ВидИмущества = УправлениеОсновнымиСредствамиКлиентСервер.ВидИмуществаПоСчетуУчета(СтрокаТаблицы.СчетУчета);
		КонецЕсли;
		
		Если БухгалтерскийУчет.СчетВИерархии(СтрокаТаблицы.СчетУчета, "111.60") Тогда
			СПИ = БухгалтерскиеОперации.СрокПолезногоИспользованияОС(СтрокаТаблицы.ОсновноеСредство, Запрос.Параметры.Период);
			КодКОСГУ = "35" + ?(СПИ = 0, "3", "2");
			ЭлКОСГУ = Справочники.КОСГУ.НайтиПоКоду(КодКОСГУ);
			Если ЗначениеЗаполнено(ЭлКОСГУ) Тогда
				СтрокаТаблицы.КЭК = ЭлКОСГУ;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ТекстЗапросаУчетныеДанные()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК СчетУчета,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КПС, &ПустойКПС) КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаБалансе) КАК ВидУчетаКлюч,
	|	ИСТИНА КАК СравниватьКПС
	|ПОМЕСТИТЬ ВТ_ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетаБаланс), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	СоответствиеСчетовОС.СчетОС,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	&ПустойКПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаБалансе),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет21), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = СоответствиеСчетовОС.ЗабалансовыйСчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка),
	|	&ПустойКПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.КапВложение),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетаКапВложение), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.ВПути),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетаВПути), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	&ПустойКПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.Арендованные),
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет01), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	&ПустойКПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаОтветственномХранении),
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&Счет02), &Субконто1, Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета КАК ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества КАК ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО КАК КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС КАК КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.ИФО КАК ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаБалансе) КАК ВидУчетаКлюч
	|ПОМЕСТИТЬ ВТ_ДанныеУчетные
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетУчета В (&СчетаБаланс)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.КапВложение)
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетУчета В (&СчетаКапВложение)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.ВПути)
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетУчета В (&СчетаВПути)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.Арендованные)
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетУчета В (&Счет01)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.ИФО,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаОтветственномХранении)
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетУчета В (&Счет02)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОстаткиБУ.ВидУчетаКлюч КАК Ключ,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_Дубли
	|ИЗ
	|	ВТ_ОстаткиБУ КАК ВТ_ОстаткиБУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиБУ.ОсновноеСредство,
	|	ВТ_ОстаткиБУ.ВидУчетаКлюч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиБУ.Организация КАК Организация,
	|	ВТ_ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОстаткиБУ.ВидУчетаКлюч КАК ВидУчетаКлюч,
	|	ВТ_ОстаткиБУ.СравниватьКПС КАК СравниватьКПС,
	|	ВТ_ОстаткиБУ.СчетУчета.Порядок КАК СчетПорядок,
	|	ВТ_ОстаткиБУ.СчетУчета КАК СчетУчетаНовый,
	|	ВТ_ОстаткиБУ.КФО КАК КФОНовый,
	|	ВТ_ОстаткиБУ.КПС КАК КПСНовый,
	|	ВТ_ОстаткиБУ.ИФО КАК ИФОНовый,
	|	ЕСТЬNULL(ВТ_ДанныеУчетные.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчета,
	|	ЕСТЬNULL(ВТ_ДанныеУчетные.ВидУчета, ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.ПустаяСсылка)) КАК ВидУчета,
	|	ЕСТЬNULL(ВТ_ДанныеУчетные.ВидИмущества, ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)) КАК ВидИмущества,
	|	ЕСТЬNULL(ВТ_ДанныеУчетные.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)) КАК КФО,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТ_ДанныеУчетные.КПС КАК Справочник.КлассификационныеПризнакиСчетов), &ПустойКПС) КАК КПС,
	|	ЕСТЬNULL(ВТ_ДанныеУчетные.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_ОстаткиБУ КАК ВТ_ОстаткиБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеУчетные КАК ВТ_ДанныеУчетные
	|		ПО ВТ_ОстаткиБУ.ОсновноеСредство = ВТ_ДанныеУчетные.ОсновноеСредство
	|			И ВТ_ОстаткиБУ.ВидУчетаКлюч = ВТ_ДанныеУчетные.ВидУчетаКлюч
	|ГДЕ
	|	ВТ_ОстаткиБУ.ОсновноеСредство ССЫЛКА Справочник.ОсновныеСредства
	|	И НЕ ВТ_ОстаткиБУ.ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ_Дубли.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ВТ_Дубли КАК ВТ_Дубли
	|				ГДЕ
	|					ВТ_Дубли.Количество > 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Организация КАК Организация,
	|	ВТ_Данные.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Данные.СчетУчетаНовый КАК СчетУчета,
	|	ВТ_Данные.ВидУчетаКлюч КАК ВидУчета,
	|	ВТ_Данные.ВидИмущества КАК ВидИмущества,
	|	ВТ_Данные.КФОНовый КАК КФО,
	|	ВТ_Данные.КПСНовый КАК КПС,
	|	ВТ_Данные.ИФОНовый КАК ИФО,
	|	ВЫБОР
	|		КОГДА ВТ_Данные.СчетУчетаНовый.УчетПоКЭК
	|			ТОГДА ВТ_Данные.СчетУчетаНовый.КОСГУДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	КОНЕЦ КАК КЭК
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	(ВТ_Данные.СчетУчетаНовый <> ВТ_Данные.СчетУчета
	|			ИЛИ ВТ_Данные.ВидУчетаКлюч <> ВТ_Данные.ВидУчета
	|			ИЛИ ВТ_Данные.КФОНовый <> ВТ_Данные.КФО
	|			ИЛИ ВТ_Данные.СравниватьКПС = ИСТИНА
	|				И ВТ_Данные.КПСНовый <> ВТ_Данные.КПС
	|			ИЛИ ВТ_Данные.ИФОНовый <> ВТ_Данные.ИФО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Данные.СчетПорядок,
	|	ВТ_Данные.ОсновноеСредство";
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		ПустойИФО = "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЖурналПроводокЕПСБУОстатки.ИФО"			, ПустойИФО);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "УчетныеДанныеОбъектаОССрезПоследних.ИФО"	, ПустойИФО);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
